#include "CHud.h"
#include "../../memory/Memory.h"
#include "../offsets.h"

class hudd
{
public:
	bool N000016CD; //0x0000
	bool N000030D4; //0x0001
	bool N0000334B; //0x0002
	bool N000036F7; //0x0003
	bool N0000334C; //0x0004
	bool N000030D5; //0x0005
	bool N0000334E; //0x0006
	bool N000030D6; //0x0007
	bool N000016CE; //0x0008
	bool N000030D8; //0x0009
	bool N00003351; //0x000A
	bool N000036FB; //0x000B
	bool N00003352; //0x000C
	bool N000030D9; //0x000D
	bool N00003354; //0x000E
	bool N000030DA; //0x000F
	bool N000016CF; //0x0010
	bool N000030DC; //0x0011
	bool N00003357; //0x0012
	bool N000036FF; //0x0013
	bool N00003358; //0x0014
	bool N000030DD; //0x0015
	bool N0000335A; //0x0016
	bool N000030DE; //0x0017
	bool N000016D0; //0x0018
	bool N000030E0; //0x0019
	bool N0000335D; //0x001A
	bool N00003703; //0x001B
	bool N0000335E; //0x001C
	bool N000030E1; //0x001D
	bool N00003360; //0x001E
	bool N000030E2; //0x001F
	bool N000016D1; //0x0020
	bool N000030E4; //0x0021
	bool N00003363; //0x0022
	bool N00003707; //0x0023
	bool N00003364; //0x0024
	bool N000030E5; //0x0025
	bool N00003366; //0x0026
	bool N000030E6; //0x0027
	bool N000016D2; //0x0028
	bool N000030E8; //0x0029
	bool N00003369; //0x002A
	bool N0000370B; //0x002B
	bool N0000336A; //0x002C
	bool N000030E9; //0x002D
	bool N0000336C; //0x002E
	bool N000030EA; //0x002F
	bool N000016D3; //0x0030
	bool N000030EC; //0x0031
	bool N0000336F; //0x0032
	bool N0000370F; //0x0033
	bool N00003370; //0x0034
	bool N000030ED; //0x0035
	bool N00003372; //0x0036
	bool N000030EE; //0x0037
	bool N000016D4; //0x0038
	bool N000030F0; //0x0039
	bool N00003375; //0x003A
	bool N00003713; //0x003B
	bool N00003376; //0x003C
	bool N000030F1; //0x003D
	bool N00003378; //0x003E
	bool N000030F2; //0x003F
	bool N000016D5; //0x0040
	bool N000030F4; //0x0041
	bool N0000337B; //0x0042
	bool N00003717; //0x0043
	bool N0000337C; //0x0044
	bool N000030F5; //0x0045
	bool N0000337E; //0x0046
	bool N000030F6; //0x0047
	bool N000016D6; //0x0048
	bool N000030F8; //0x0049
	bool N00003381; //0x004A
	bool N0000371B; //0x004B
	bool N00003382; //0x004C
	bool N000030F9; //0x004D
	bool N00003384; //0x004E
	bool N000030FA; //0x004F
	bool N000016D7; //0x0050
	bool N000030FC; //0x0051
	bool N00003387; //0x0052
	bool N0000371F; //0x0053
	bool N00003388; //0x0054
	bool N000030FD; //0x0055
	bool N0000338A; //0x0056
	bool N000030FE; //0x0057
	bool N000016D8; //0x0058
	bool N00003100; //0x0059
	bool N0000338D; //0x005A
	bool N00003723; //0x005B
	bool N0000338E; //0x005C
	bool N00003101; //0x005D
	bool N00003390; //0x005E
	bool N00003102; //0x005F
	bool N000016D9; //0x0060
	bool N00003104; //0x0061
	bool N00003393; //0x0062
	bool N00003727; //0x0063
	bool N00003394; //0x0064
	bool N00003105; //0x0065
	bool N00003396; //0x0066
	bool N00003106; //0x0067
	bool N000016DA; //0x0068
	bool N00003108; //0x0069
	bool N00003399; //0x006A
	bool N0000372B; //0x006B
	bool N0000339A; //0x006C
	bool N00003109; //0x006D
	bool N0000339C; //0x006E
	bool N0000310A; //0x006F
	bool N000016DB; //0x0070
	bool N0000310C; //0x0071
	bool N0000339F; //0x0072
	bool N0000372F; //0x0073
	bool N000033A0; //0x0074
	bool N0000310D; //0x0075
	bool N000033A2; //0x0076
	bool N0000310E; //0x0077
	bool N000016DC; //0x0078
	bool N00003110; //0x0079
	bool N000033A5; //0x007A
	bool N00003733; //0x007B
	bool N000033A6; //0x007C
	bool N00003111; //0x007D
	bool N000033A8; //0x007E
	bool N00003112; //0x007F
	bool N000016DD; //0x0080
	bool N00003114; //0x0081
	bool N000033AB; //0x0082
	bool N00003737; //0x0083
	bool N000033AC; //0x0084
	bool N00003115; //0x0085
	bool N000033AE; //0x0086
	bool N00003116; //0x0087
	bool N000016DE; //0x0088
	bool N00003118; //0x0089
	bool N000033B1; //0x008A
	bool N0000373B; //0x008B
	bool N000033B2; //0x008C
	bool N00003119; //0x008D
	bool N000033B4; //0x008E
	bool N0000311A; //0x008F
	bool N000016DF; //0x0090
	bool N0000311C; //0x0091
	bool N000033B7; //0x0092
	bool N0000373F; //0x0093
	bool N000033B8; //0x0094
	bool N0000311D; //0x0095
	bool N000033BA; //0x0096
	bool N0000311E; //0x0097
	bool N000016E0; //0x0098
	bool N00003120; //0x0099
	bool N000033BD; //0x009A
	bool N00003743; //0x009B
	bool N000033BE; //0x009C
	bool N00003121; //0x009D
	bool N000033C0; //0x009E
	bool N00003122; //0x009F
	bool N000016E1; //0x00A0
	bool N00003124; //0x00A1
	bool N000033C3; //0x00A2
	bool N00003747; //0x00A3
	bool N000033C4; //0x00A4
	bool N00003125; //0x00A5
	bool N000033C6; //0x00A6
	bool N00003126; //0x00A7
	bool N000016E2; //0x00A8
	bool N00003128; //0x00A9
	bool N000033C9; //0x00AA
	bool N0000374B; //0x00AB
	bool N000033CA; //0x00AC
	bool N00003129; //0x00AD
	bool N000033CC; //0x00AE
	bool N0000312A; //0x00AF
	bool N000016E3; //0x00B0
	bool N0000312C; //0x00B1
	bool N000033CF; //0x00B2
	bool N0000374F; //0x00B3
	bool N000033D0; //0x00B4
	bool N0000312D; //0x00B5
	bool N000033D2; //0x00B6
	bool N0000312E; //0x00B7
	bool N000016E4; //0x00B8
	bool N00003130; //0x00B9
	bool N000033D5; //0x00BA
	bool N00003753; //0x00BB
	bool N000033D6; //0x00BC
	bool N00003131; //0x00BD
	bool N000033D8; //0x00BE
	bool N00003132; //0x00BF
	bool N000016E5; //0x00C0
	bool N00003134; //0x00C1
	bool N000033DB; //0x00C2
	bool N00003757; //0x00C3
	bool N000033DC; //0x00C4
	bool N00003135; //0x00C5
	bool N000033DE; //0x00C6
	bool N00003136; //0x00C7
	bool N000016E6; //0x00C8
	bool N00003138; //0x00C9
	bool N000033E1; //0x00CA
	bool N0000375B; //0x00CB
	bool N000033E2; //0x00CC
	bool N00003139; //0x00CD
	bool N000033E4; //0x00CE
	bool N0000313A; //0x00CF
	bool N000016E7; //0x00D0
	bool N0000313C; //0x00D1
	bool N000033E7; //0x00D2
	bool N0000375F; //0x00D3
	bool N000033E8; //0x00D4
	bool N0000313D; //0x00D5
	bool N000033EA; //0x00D6
	bool N0000313E; //0x00D7
	bool N000016E8; //0x00D8
	bool N00003140; //0x00D9
	bool N000033ED; //0x00DA
	bool N00003763; //0x00DB
	bool N000033EE; //0x00DC
	bool N00003141; //0x00DD
	bool N000033F0; //0x00DE
	bool N00003142; //0x00DF
	bool N000016E9; //0x00E0
	bool N00003144; //0x00E1
	bool N000033F3; //0x00E2
	bool N00003767; //0x00E3
	bool N000033F4; //0x00E4
	bool N00003145; //0x00E5
	bool N000033F6; //0x00E6
	bool N00003146; //0x00E7
	bool N000016EA; //0x00E8
	bool N00003148; //0x00E9
	bool N000033F9; //0x00EA
	bool N0000376B; //0x00EB
	bool N000033FA; //0x00EC
	bool N00003149; //0x00ED
	bool N000033FC; //0x00EE
	bool N0000314A; //0x00EF
	bool N000016EB; //0x00F0
	bool N0000314C; //0x00F1
	bool N000033FF; //0x00F2
	bool N0000376F; //0x00F3
	bool N00003400; //0x00F4
	bool N0000314D; //0x00F5
	bool N00003402; //0x00F6
	bool N0000314E; //0x00F7
	bool N000016EC; //0x00F8
	bool N00003150; //0x00F9
	bool N00003405; //0x00FA
	bool N00003773; //0x00FB
	bool N00003406; //0x00FC
	bool N00003151; //0x00FD
	bool N00003408; //0x00FE
	bool N00003152; //0x00FF
	bool N000016ED; //0x0100
	bool N00003154; //0x0101
	bool N0000340B; //0x0102
	bool N00003777; //0x0103
	bool N0000340C; //0x0104
	bool N00003155; //0x0105
	bool N0000340E; //0x0106
	bool N00003156; //0x0107
	bool N000016EE; //0x0108
	bool N00003158; //0x0109
	bool N00003411; //0x010A
	bool N0000377B; //0x010B
	bool N00003412; //0x010C
	bool N00003159; //0x010D
	bool N00003414; //0x010E
	bool N0000315A; //0x010F
	bool N000016EF; //0x0110
	bool N0000315C; //0x0111
	bool N00003417; //0x0112
	bool N0000377F; //0x0113
	bool N00003418; //0x0114
	bool N0000315D; //0x0115
	bool N0000341A; //0x0116
	bool N0000315E; //0x0117
	bool N000016F0; //0x0118
	bool N00003160; //0x0119
	bool N0000341D; //0x011A
	bool N00003783; //0x011B
	bool N0000341E; //0x011C
	bool N00003161; //0x011D
	bool N00003420; //0x011E
	bool N00003162; //0x011F
	bool N000016F1; //0x0120
	bool N00003164; //0x0121
	bool N00003423; //0x0122
	bool N00003787; //0x0123
	bool N00003424; //0x0124
	bool N00003165; //0x0125
	bool N00003426; //0x0126
	bool N00003166; //0x0127
	bool N000016F2; //0x0128
	bool N00003168; //0x0129
	bool N00003429; //0x012A
	bool N0000378B; //0x012B
	bool N0000342A; //0x012C
	bool N00003169; //0x012D
	bool N0000342C; //0x012E
	bool N0000316A; //0x012F
	bool N000016F3; //0x0130
	bool N0000316C; //0x0131
	bool N0000342F; //0x0132
	bool N0000378F; //0x0133
	bool N00003430; //0x0134
	bool N0000316D; //0x0135
	bool N00003432; //0x0136
	bool N0000316E; //0x0137
	bool N000016F4; //0x0138
	bool N00003170; //0x0139
	bool N00003435; //0x013A
	bool N00003793; //0x013B
	bool N00003436; //0x013C
	bool N00003171; //0x013D
	bool N00003438; //0x013E
	bool N00003172; //0x013F
	bool N000016F5; //0x0140
	bool N00003174; //0x0141
	bool N0000343B; //0x0142
	bool N00003797; //0x0143
	bool N0000343C; //0x0144
	bool N00003175; //0x0145
	bool N0000343E; //0x0146
	bool N00003176; //0x0147
	bool N000016F6; //0x0148
	bool N00003178; //0x0149
	bool N00003441; //0x014A
	bool N0000379B; //0x014B
	bool N00003442; //0x014C
	bool N00003179; //0x014D
	bool N00003444; //0x014E
	bool N0000317A; //0x014F
	bool N000016F7; //0x0150
	bool N0000317C; //0x0151
	bool N00003447; //0x0152
	bool N0000379F; //0x0153
	bool N00003448; //0x0154
	bool N0000317D; //0x0155
	bool N0000344A; //0x0156
	bool N0000317E; //0x0157
	bool N000016F8; //0x0158
	bool N00003180; //0x0159
	bool N0000344D; //0x015A
	bool N000037A3; //0x015B
	bool N0000344E; //0x015C
	bool N00003181; //0x015D
	bool N00003450; //0x015E
	bool N00003182; //0x015F
	bool N000016F9; //0x0160
	bool N00003184; //0x0161
	bool N00003453; //0x0162
	bool N000037A7; //0x0163
	bool N00003454; //0x0164
	bool N00003185; //0x0165
	bool N00003456; //0x0166
	bool N00003186; //0x0167
	bool N000016FA; //0x0168
	bool N00003188; //0x0169
	bool N00003459; //0x016A
	bool N000037AB; //0x016B
	bool N0000345A; //0x016C
	bool N00003189; //0x016D
	bool N0000345C; //0x016E
	bool N0000318A; //0x016F
	bool N000016FB; //0x0170
	bool N0000318C; //0x0171
	bool N0000345F; //0x0172
	bool N000037AF; //0x0173
	bool N00003460; //0x0174
	bool N0000318D; //0x0175
	bool N00003462; //0x0176
	bool N0000318E; //0x0177
	bool N000016FC; //0x0178
	bool N00003190; //0x0179
	bool N00003465; //0x017A
	bool N000037B3; //0x017B
	bool N00003466; //0x017C
	bool N00003191; //0x017D
	bool N00003468; //0x017E
	bool N00003192; //0x017F
	bool N000016FD; //0x0180
	bool N00003194; //0x0181
	bool N0000346B; //0x0182
	bool N000037B7; //0x0183
	bool N0000346C; //0x0184
	bool N00003195; //0x0185
	bool N0000346E; //0x0186
	bool N00003196; //0x0187
	bool N000016FE; //0x0188
	bool N00003198; //0x0189
	bool N00003471; //0x018A
	bool N000037BB; //0x018B
	bool N00003472; //0x018C
	bool N00003199; //0x018D
	bool N00003474; //0x018E
	bool N0000319A; //0x018F
	bool N000016FF; //0x0190
	bool N0000319C; //0x0191
	bool N00003477; //0x0192
	bool N000037BF; //0x0193
	bool N00003478; //0x0194
	bool N0000319D; //0x0195
	bool N0000347A; //0x0196
	bool N0000319E; //0x0197
	bool N00001700; //0x0198
	bool N000031A0; //0x0199
	bool N0000347D; //0x019A
	bool N000037C3; //0x019B
	bool N0000347E; //0x019C
	bool N000031A1; //0x019D
	bool N00003480; //0x019E
	bool N000031A2; //0x019F
	bool N00001701; //0x01A0
	bool N000031A4; //0x01A1
	bool N00003483; //0x01A2
	bool N000037C7; //0x01A3
	bool N00003484; //0x01A4
	bool N000031A5; //0x01A5
	bool N00003486; //0x01A6
	bool N000031A6; //0x01A7
	bool N00001702; //0x01A8
	bool N000031A8; //0x01A9
	bool N00003489; //0x01AA
	bool N000037CB; //0x01AB
	bool N0000348A; //0x01AC
	bool N000031A9; //0x01AD
	bool N0000348C; //0x01AE
	bool N000031AA; //0x01AF
	bool N00001703; //0x01B0
	bool N000031AC; //0x01B1
	bool N0000348F; //0x01B2
	bool N000037CF; //0x01B3
	bool N00003490; //0x01B4
	bool N000031AD; //0x01B5
	bool N00003492; //0x01B6
	bool N000031AE; //0x01B7
	bool N00001704; //0x01B8
	bool N000031B0; //0x01B9
	bool N00003495; //0x01BA
	bool N000037D3; //0x01BB
	bool N00003496; //0x01BC
	bool N000031B1; //0x01BD
	bool N00003498; //0x01BE
	bool N000031B2; //0x01BF
	bool N00001705; //0x01C0
	bool N000031B4; //0x01C1
	bool N0000349B; //0x01C2
	bool N000037D7; //0x01C3
	bool N0000349C; //0x01C4
	bool N000031B5; //0x01C5
	bool N0000349E; //0x01C6
	bool N000031B6; //0x01C7
	bool N00001706; //0x01C8
	bool N000031B8; //0x01C9
	bool N000034A1; //0x01CA
	bool N000037DB; //0x01CB
	bool N000034A2; //0x01CC
	bool N000031B9; //0x01CD
	bool N000034A4; //0x01CE
	bool N000031BA; //0x01CF
	bool N00001707; //0x01D0
	bool N000031BC; //0x01D1
	bool N000034A7; //0x01D2
	bool N000037DF; //0x01D3
	bool N000034A8; //0x01D4
	bool N000031BD; //0x01D5
	bool N000034AA; //0x01D6
	bool N000031BE; //0x01D7
	bool N00001708; //0x01D8
	bool N000031C0; //0x01D9
	bool N000034AD; //0x01DA
	bool N000037E3; //0x01DB
	bool N000034AE; //0x01DC
	bool N000031C1; //0x01DD
	bool N000034B0; //0x01DE
	bool N000031C2; //0x01DF
	bool N00001709; //0x01E0
	bool N000031C4; //0x01E1
	bool N000034B3; //0x01E2
	bool N000037E7; //0x01E3
	bool N000034B4; //0x01E4
	bool N000031C5; //0x01E5
	bool N000034B6; //0x01E6
	bool N000031C6; //0x01E7
	bool N0000170A; //0x01E8
	bool N000031C8; //0x01E9
	bool N000034B9; //0x01EA
	bool N000037EB; //0x01EB
	bool N000034BA; //0x01EC
	bool N000031C9; //0x01ED
	bool N000034BC; //0x01EE
	bool N000031CA; //0x01EF
	bool N0000170B; //0x01F0
	bool N000031CC; //0x01F1
	bool N000034BF; //0x01F2
	bool N000037EF; //0x01F3
	bool N000034C0; //0x01F4
	bool N000031CD; //0x01F5
	bool N000034C2; //0x01F6
	bool N000031CE; //0x01F7
	bool N0000170C; //0x01F8
	bool N000031D0; //0x01F9
	bool N000034C5; //0x01FA
	bool N000037F3; //0x01FB
	bool N000034C6; //0x01FC
	bool N000031D1; //0x01FD
	bool N000034C8; //0x01FE
	bool N000031D2; //0x01FF
	bool N0000170D; //0x0200
	bool N000031D4; //0x0201
	bool N000034CB; //0x0202
	bool N000037F7; //0x0203
	bool N000034CC; //0x0204
	bool N000031D5; //0x0205
	bool N000034CE; //0x0206
	bool N000031D6; //0x0207
	bool N0000170E; //0x0208
	bool N000031D8; //0x0209
	bool N000034D1; //0x020A
	bool N000037FB; //0x020B
	bool N000034D2; //0x020C
	bool N000031D9; //0x020D
	bool N000034D4; //0x020E
	bool N000031DA; //0x020F
	bool N0000170F; //0x0210
	bool N000031DC; //0x0211
	bool N000034D7; //0x0212
	bool N000037FF; //0x0213
	bool N000034D8; //0x0214
	bool N000031DD; //0x0215
	bool N000034DA; //0x0216
	bool N000031DE; //0x0217
	bool N00001710; //0x0218
	bool N000031E0; //0x0219
	bool N000034DD; //0x021A
	bool N00003803; //0x021B
	bool N000034DE; //0x021C
	bool N000031E1; //0x021D
	bool N000034E0; //0x021E
	bool N000031E2; //0x021F
	bool N00001711; //0x0220
	bool N000031E4; //0x0221
	bool N000034E3; //0x0222
	bool N00003807; //0x0223
	bool N000034E4; //0x0224
	bool N000031E5; //0x0225
	bool N000034E6; //0x0226
	bool N000031E6; //0x0227
	bool N00001712; //0x0228
	bool N000031E8; //0x0229
	bool N000034E9; //0x022A
	bool N0000380B; //0x022B
	bool N000034EA; //0x022C
	bool N000031E9; //0x022D
	bool N000034EC; //0x022E
	bool N000031EA; //0x022F
	bool N00001713; //0x0230
	bool N000031EC; //0x0231
	bool N000034EF; //0x0232
	bool N0000380F; //0x0233
	bool N000034F0; //0x0234
	bool N000031ED; //0x0235
	bool N000034F2; //0x0236
	bool N000031EE; //0x0237
	bool N00001714; //0x0238
	bool N000031F0; //0x0239
	bool N000034F5; //0x023A
	bool N00003813; //0x023B
	bool N000034F6; //0x023C
	bool N000031F1; //0x023D
	bool N000034F8; //0x023E
	bool N000031F2; //0x023F
	bool N00001715; //0x0240
	bool N000031F4; //0x0241
	bool N000034FB; //0x0242
	bool N00003817; //0x0243
	bool N000034FC; //0x0244
	bool N000031F5; //0x0245
	bool N000034FE; //0x0246
	bool N000031F6; //0x0247
	bool N00001716; //0x0248
	bool N000031F8; //0x0249
	bool N00003501; //0x024A
	bool N0000381B; //0x024B
	bool N00003502; //0x024C
	bool N000031F9; //0x024D
	bool N00003504; //0x024E
	bool N000031FA; //0x024F
	bool N00001717; //0x0250
	bool N000031FC; //0x0251
	bool N00003507; //0x0252
	bool N0000381F; //0x0253
	bool N00003508; //0x0254
	bool N000031FD; //0x0255
	bool N0000350A; //0x0256
	bool N000031FE; //0x0257
	bool N00001718; //0x0258
	bool N00003200; //0x0259
	bool N0000350D; //0x025A
	bool N00003823; //0x025B
	bool N0000350E; //0x025C
	bool N00003201; //0x025D
	bool N00003510; //0x025E
	bool N00003202; //0x025F
	bool N00001719; //0x0260
	bool N00003204; //0x0261
	bool N00003513; //0x0262
	bool N00003827; //0x0263
	bool N00003514; //0x0264
	bool N00003205; //0x0265
	bool N00003516; //0x0266
	bool N00003206; //0x0267
	bool N0000171A; //0x0268
	bool N00003208; //0x0269
	bool N00003519; //0x026A
	bool N0000382B; //0x026B
	bool N0000351A; //0x026C
	bool N00003209; //0x026D
	bool N0000351C; //0x026E
	bool N0000320A; //0x026F
	bool N0000171B; //0x0270
	bool N0000320C; //0x0271
	bool N0000351F; //0x0272
	bool N0000382F; //0x0273
	bool N00003520; //0x0274
	bool N0000320D; //0x0275
	bool N00003522; //0x0276
	bool N0000320E; //0x0277
	bool N0000171C; //0x0278
	bool N00003210; //0x0279
	bool N00003525; //0x027A
	bool N00003833; //0x027B
	bool N00003526; //0x027C
	bool N00003211; //0x027D
	bool N00003528; //0x027E
	bool N00003212; //0x027F
	bool N0000171D; //0x0280
	bool N00003214; //0x0281
	bool N0000352B; //0x0282
	bool N00003837; //0x0283
	bool N0000352C; //0x0284
	bool N00003215; //0x0285
	bool N0000352E; //0x0286
	bool N00003216; //0x0287
	bool N0000171E; //0x0288
	bool N00003218; //0x0289
	bool N00003531; //0x028A
	bool N0000383B; //0x028B
	bool N00003532; //0x028C
	bool N00003219; //0x028D
	bool N00003534; //0x028E
	bool N0000321A; //0x028F
	bool N0000171F; //0x0290
	bool N0000321C; //0x0291
	bool N00003537; //0x0292
	bool N0000383F; //0x0293
	bool N00003538; //0x0294
	bool N0000321D; //0x0295
	bool N0000353A; //0x0296
	bool N0000321E; //0x0297
	bool N00001720; //0x0298
	bool N000017D6; //0x0299
	bool N00003221; //0x029A
	bool N0000353D; //0x029B
	bool N00003222; //0x029C
	bool N000017D7; //0x029D
	bool N00003224; //0x029E
	bool N000017D8; //0x029F
	bool N00001721; //0x02A0
	bool N00003227; //0x02A1
	bool N00003541; //0x02A2
	bool N00003844; //0x02A3
	bool N00003542; //0x02A4
	bool N00003228; //0x02A5
	bool N00003544; //0x02A6
	bool N00003229; //0x02A7
	bool N00001722; //0x02A8
	bool N0000322B; //0x02A9
	bool N00003547; //0x02AA
	bool N00003848; //0x02AB
	bool N00003548; //0x02AC
	bool N0000322C; //0x02AD
	bool N0000354A; //0x02AE
	bool N0000322D; //0x02AF
	bool N00001723; //0x02B0
	bool N0000322F; //0x02B1
	bool N0000354D; //0x02B2
	bool N0000384C; //0x02B3
	bool N0000354E; //0x02B4
	bool N00003230; //0x02B5
	bool N00003550; //0x02B6
	bool N00003231; //0x02B7
	bool N00001724; //0x02B8
	bool N00003233; //0x02B9
	bool N00003553; //0x02BA
	bool N00003850; //0x02BB
	bool N00003554; //0x02BC
	bool N00003234; //0x02BD
	bool N00003556; //0x02BE
	bool N00003235; //0x02BF
	bool N00001725; //0x02C0
	bool N00003237; //0x02C1
	bool N00003559; //0x02C2
	bool N00003854; //0x02C3
	bool N0000355A; //0x02C4
	bool N00003238; //0x02C5
	bool N0000355C; //0x02C6
	bool N00003239; //0x02C7
	bool N00001726; //0x02C8
	bool N0000323B; //0x02C9
	bool N0000355F; //0x02CA
	bool N00003858; //0x02CB
	bool N00003560; //0x02CC
	bool N0000323C; //0x02CD
	bool N00003562; //0x02CE
	bool N0000323D; //0x02CF
	bool N00001727; //0x02D0
	bool N0000323F; //0x02D1
	bool N00003565; //0x02D2
	bool N0000385C; //0x02D3
	bool N00003566; //0x02D4
	bool N00003240; //0x02D5
	bool N00003568; //0x02D6
	bool N00003241; //0x02D7
	bool N00001728; //0x02D8
	bool N00003243; //0x02D9
	bool N0000356B; //0x02DA
	bool N00003860; //0x02DB
	bool N0000356C; //0x02DC
	bool N00003244; //0x02DD
	bool N0000356E; //0x02DE
	bool N00003245; //0x02DF
	bool N00001729; //0x02E0
	bool N00003247; //0x02E1
	bool N00003571; //0x02E2
	bool N00003864; //0x02E3
	bool N00003572; //0x02E4
	bool N00003248; //0x02E5
	bool N00003574; //0x02E6
	bool N00003249; //0x02E7
	bool N0000172A; //0x02E8
	bool N0000324B; //0x02E9
	bool N00003577; //0x02EA
	bool N00003868; //0x02EB
	bool N00003578; //0x02EC
	bool N0000324C; //0x02ED
	bool N0000357A; //0x02EE
	bool N0000324D; //0x02EF
	bool N0000172B; //0x02F0
	bool N0000324F; //0x02F1
	bool N0000357D; //0x02F2
	bool N0000386C; //0x02F3
	bool N0000357E; //0x02F4
	bool N00003250; //0x02F5
	bool N00003580; //0x02F6
	bool N00003251; //0x02F7
	bool N0000172C; //0x02F8
	bool N00003253; //0x02F9
	bool N00003583; //0x02FA
	bool N00003870; //0x02FB
	bool N00003584; //0x02FC
	bool N00003254; //0x02FD
	bool N00003586; //0x02FE
	bool N00003255; //0x02FF
	bool N0000172D; //0x0300
	bool N00003257; //0x0301
	bool N00003589; //0x0302
	bool N00003874; //0x0303
	bool N0000358A; //0x0304
	bool N00003258; //0x0305
	bool N0000358C; //0x0306
	bool N00003259; //0x0307
	bool N0000172E; //0x0308
	bool N0000325B; //0x0309
	bool N0000358F; //0x030A
	bool N00003878; //0x030B
	bool N00003590; //0x030C
	bool N0000325C; //0x030D
	bool N00003592; //0x030E
	bool N0000325D; //0x030F
	bool N0000172F; //0x0310
	bool N0000325F; //0x0311
	bool N00003595; //0x0312
	bool N0000387C; //0x0313
	bool N00003596; //0x0314
	bool N00003260; //0x0315
	bool N00003598; //0x0316
	bool N00003261; //0x0317
	bool N00001730; //0x0318
	bool N00003263; //0x0319
	bool N0000359B; //0x031A
	bool N00003880; //0x031B
	bool N0000359C; //0x031C
	bool N00003264; //0x031D
	bool N0000359E; //0x031E
	bool N00003265; //0x031F
	bool N00001731; //0x0320
	bool N00003267; //0x0321
	bool N000035A1; //0x0322
	bool N00003884; //0x0323
	bool N000035A2; //0x0324
	bool N00003268; //0x0325
	bool N000035A4; //0x0326
	bool N00003269; //0x0327
	bool N00001732; //0x0328
	bool N0000326B; //0x0329
	bool N000035A7; //0x032A
	bool N00003888; //0x032B
	bool N000035A8; //0x032C
	bool N0000326C; //0x032D
	bool N000035AA; //0x032E
	bool N0000326D; //0x032F
	bool N00001733; //0x0330
	bool N0000326F; //0x0331
	bool N000035AD; //0x0332
	bool N0000388C; //0x0333
	bool N000035AE; //0x0334
	bool N00003270; //0x0335
	bool N000035B0; //0x0336
	bool N00003271; //0x0337
	bool N00001734; //0x0338
	bool N00003273; //0x0339
	bool N000035B3; //0x033A
	bool N00003890; //0x033B
	bool N000035B4; //0x033C
	bool N00003274; //0x033D
	bool N000035B6; //0x033E
	bool N00003275; //0x033F
	bool N00001735; //0x0340
	bool N00003277; //0x0341
	bool N000035B9; //0x0342
	bool N00003894; //0x0343
	bool N000035BA; //0x0344
	bool N00003278; //0x0345
	bool N000035BC; //0x0346
	bool N00003279; //0x0347
	bool N00001736; //0x0348
	bool N0000327B; //0x0349
	bool N000035BF; //0x034A
	bool N00003898; //0x034B
	bool N000035C0; //0x034C
	bool N0000327C; //0x034D
	bool N000035C2; //0x034E
	bool N0000327D; //0x034F
	bool N00001737; //0x0350
	bool N0000327F; //0x0351
	bool N000035C5; //0x0352
	bool N0000389C; //0x0353
	bool N000035C6; //0x0354
	bool N00003280; //0x0355
	bool N000035C8; //0x0356
	bool N00003281; //0x0357
	bool N00001738; //0x0358
	bool N00003283; //0x0359
	bool N000035CB; //0x035A
	bool N000038A0; //0x035B
	bool N000035CC; //0x035C
	bool N00003284; //0x035D
	bool N000035CE; //0x035E
	bool N00003285; //0x035F
	bool N00001739; //0x0360
	bool N00003287; //0x0361
	bool N000035D1; //0x0362
	bool N000038A4; //0x0363
	bool N000035D2; //0x0364
	bool N00003288; //0x0365
	bool N000035D4; //0x0366
	bool N00003289; //0x0367
	bool N0000173A; //0x0368
	bool N0000328B; //0x0369
	bool N000035D7; //0x036A
	bool N000038A8; //0x036B
	bool N000035D8; //0x036C
	bool N0000328C; //0x036D
	bool N000035DA; //0x036E
	bool N0000328D; //0x036F
	bool N0000173B; //0x0370
	bool N0000328F; //0x0371
	bool N000035DD; //0x0372
	bool N000038AC; //0x0373
	bool N000035DE; //0x0374
	bool N00003290; //0x0375
	bool N000035E0; //0x0376
	bool N00003291; //0x0377
	bool N0000173C; //0x0378
	bool N00003293; //0x0379
	bool N000035E3; //0x037A
	bool N000038B0; //0x037B
	bool N000035E4; //0x037C
	bool N00003294; //0x037D
	bool N000035E6; //0x037E
	bool N00003295; //0x037F
	bool N0000173D; //0x0380
	bool N00003297; //0x0381
	bool N000035E9; //0x0382
	bool N000038B4; //0x0383
	bool N000035EA; //0x0384
	bool N00003298; //0x0385
	bool N000035EC; //0x0386
	bool N00003299; //0x0387
	bool N0000173E; //0x0388
	bool N0000329B; //0x0389
	bool N000035EF; //0x038A
	bool N000038B8; //0x038B
	bool N000035F0; //0x038C
	bool N0000329C; //0x038D
	bool N000035F2; //0x038E
	bool N0000329D; //0x038F
	bool N0000173F; //0x0390
	bool N0000329F; //0x0391
	bool N000035F5; //0x0392
	bool N000038BC; //0x0393
	bool N000035F6; //0x0394
	bool N000032A0; //0x0395
	bool N000035F8; //0x0396
	bool N000032A1; //0x0397
	bool N00001740; //0x0398
	bool N000032A3; //0x0399
	bool N000035FB; //0x039A
	bool N000038C0; //0x039B
	bool N000035FC; //0x039C
	bool N000032A4; //0x039D
	bool N000035FE; //0x039E
	bool N000032A5; //0x039F
	bool N00001741; //0x03A0
	bool N000032A7; //0x03A1
	bool N00003601; //0x03A2
	bool N000038C4; //0x03A3
	bool N00003602; //0x03A4
	bool N000032A8; //0x03A5
	bool N00003604; //0x03A6
	bool N000032A9; //0x03A7
	bool N00001742; //0x03A8
	bool N000032AB; //0x03A9
	bool N00003607; //0x03AA
	bool N000038C8; //0x03AB
	bool N00003608; //0x03AC
	bool N000032AC; //0x03AD
	bool N0000360A; //0x03AE
	bool N000032AD; //0x03AF
	bool N00001743; //0x03B0
	bool N000032AF; //0x03B1
	bool N0000360D; //0x03B2
	bool N000038CC; //0x03B3
	bool N0000360E; //0x03B4
	bool N000032B0; //0x03B5
	bool N00003610; //0x03B6
	bool N000032B1; //0x03B7
	bool N00001744; //0x03B8
	bool N000032B3; //0x03B9
	bool N00003613; //0x03BA
	bool N000038D0; //0x03BB
	bool N00003614; //0x03BC
	bool N000032B4; //0x03BD
	bool N00003616; //0x03BE
	bool N000032B5; //0x03BF
	bool N00001745; //0x03C0
	bool N000032B7; //0x03C1
	bool N00003619; //0x03C2
	bool N000038D4; //0x03C3
	bool N0000361A; //0x03C4
	bool N000032B8; //0x03C5
	bool N0000361C; //0x03C6
	bool N000032B9; //0x03C7
	bool N00001746; //0x03C8
	bool N000032BB; //0x03C9
	bool N0000361F; //0x03CA
	bool N000038D8; //0x03CB
	bool N00003620; //0x03CC
	bool N000032BC; //0x03CD
	bool N00003622; //0x03CE
	bool N000032BD; //0x03CF
	bool N00001747; //0x03D0
	bool N000032BF; //0x03D1
	bool N00003625; //0x03D2
	bool N000038DC; //0x03D3
	bool N00003626; //0x03D4
	bool N000032C0; //0x03D5
	bool N00003628; //0x03D6
	bool N000032C1; //0x03D7
	bool N00001748; //0x03D8
	bool N000032C3; //0x03D9
	bool N0000362B; //0x03DA
	bool N000038E0; //0x03DB
	bool N0000362C; //0x03DC
	bool N000032C4; //0x03DD
	bool N0000362E; //0x03DE
	bool N000032C5; //0x03DF
	bool N00001749; //0x03E0
	bool N000032C7; //0x03E1
	bool N00003631; //0x03E2
	bool N000038E4; //0x03E3
	bool N00003632; //0x03E4
	bool N000032C8; //0x03E5
	bool N00003634; //0x03E6
	bool N000032C9; //0x03E7
	bool N0000174A; //0x03E8
	bool N000032CB; //0x03E9
	bool N00003637; //0x03EA
	bool N000038E8; //0x03EB
	bool N00003638; //0x03EC
	bool N000032CC; //0x03ED
	bool N0000363A; //0x03EE
	bool N000032CD; //0x03EF
	bool N0000174B; //0x03F0
	bool N000032CF; //0x03F1
	bool N0000363D; //0x03F2
	bool N000038EC; //0x03F3
	bool N0000363E; //0x03F4
	bool N000032D0; //0x03F5
	bool N00003640; //0x03F6
	bool N000032D1; //0x03F7
	bool N0000174C; //0x03F8
	bool N000032D3; //0x03F9
	bool N00003643; //0x03FA
	bool N000038F0; //0x03FB
	bool N00003644; //0x03FC
	bool N000032D4; //0x03FD
	bool N00003646; //0x03FE
	bool N000032D5; //0x03FF
	bool N0000174D; //0x0400
	bool N000032D7; //0x0401
	bool N00003649; //0x0402
	bool N000038F4; //0x0403
	bool N0000364A; //0x0404
	bool N000032D8; //0x0405
	bool N0000364C; //0x0406
	bool N000032D9; //0x0407
	bool N0000174E; //0x0408
	bool N000032DB; //0x0409
	bool N0000364F; //0x040A
	bool N000038F8; //0x040B
	bool N00003650; //0x040C
	bool N000032DC; //0x040D
	bool N00003652; //0x040E
	bool N000032DD; //0x040F
	bool N0000174F; //0x0410
	bool N000032DF; //0x0411
	bool N00003655; //0x0412
	bool N000038FC; //0x0413
	bool N00003656; //0x0414
	bool N000032E0; //0x0415
	bool N00003658; //0x0416
	bool N000032E1; //0x0417
	bool N00001750; //0x0418
	bool N000032E3; //0x0419
	bool N0000365B; //0x041A
	bool N00003900; //0x041B
	bool N0000365C; //0x041C
	bool N000032E4; //0x041D
	bool N0000365E; //0x041E
	bool N000032E5; //0x041F
	bool N00001751; //0x0420
	bool N000032E7; //0x0421
	bool N00003661; //0x0422
	bool N00003904; //0x0423
	bool N00003662; //0x0424
	bool N000032E8; //0x0425
	bool N00003664; //0x0426
	bool N000032E9; //0x0427
	bool N00001752; //0x0428
	bool N000032EB; //0x0429
	bool N00003667; //0x042A
	bool N00003908; //0x042B
	bool N00003668; //0x042C
	bool N000032EC; //0x042D
	bool N0000366A; //0x042E
	bool N000032ED; //0x042F
	bool N00001753; //0x0430
	bool N000032EF; //0x0431
	bool N0000366D; //0x0432
	bool N0000390C; //0x0433
	bool N0000366E; //0x0434
	bool N000032F0; //0x0435
	bool N00003670; //0x0436
	bool N000032F1; //0x0437
	bool N00001754; //0x0438
	bool N000032F3; //0x0439
	bool N00003673; //0x043A
	bool N00003910; //0x043B
	bool N00003674; //0x043C
	bool N000032F4; //0x043D
	bool N00003676; //0x043E
	bool N000032F5; //0x043F
	bool N00001755; //0x0440
	bool N000032F7; //0x0441
	bool N00003679; //0x0442
	bool N00003914; //0x0443
	bool N0000367A; //0x0444
	bool N000032F8; //0x0445
	bool N0000367C; //0x0446
	bool N000032F9; //0x0447
	bool N00001756; //0x0448
	bool N000032FB; //0x0449
	bool N0000367F; //0x044A
	bool N00003918; //0x044B
	bool N00003680; //0x044C
	bool N000032FC; //0x044D
	bool N00003682; //0x044E
	bool N000032FD; //0x044F
	bool N00001757; //0x0450
	bool N000032FF; //0x0451
	bool N00003685; //0x0452
	bool N0000391C; //0x0453
	bool N00003686; //0x0454
	bool N00003300; //0x0455
	bool N00003688; //0x0456
	bool N00003301; //0x0457
	bool N00001758; //0x0458
	bool N00003303; //0x0459
	bool N0000368B; //0x045A
	bool N00003920; //0x045B
	bool N0000368C; //0x045C
	bool N00003304; //0x045D
	bool N0000368E; //0x045E
	bool N00003305; //0x045F
	bool N00001759; //0x0460
	bool N00003307; //0x0461
	bool N00003691; //0x0462
	bool N00003924; //0x0463
	bool N00003692; //0x0464
	bool N00003308; //0x0465
	bool N00003694; //0x0466
	bool N00003309; //0x0467
	bool N0000175A; //0x0468
	bool N0000330B; //0x0469
	bool N00003697; //0x046A
	bool N00003928; //0x046B
	bool N00003698; //0x046C
	bool N0000330C; //0x046D
	bool N0000369A; //0x046E
	bool N0000330D; //0x046F
	bool N0000175B; //0x0470
	bool N0000330F; //0x0471
	bool N0000369D; //0x0472
	bool N0000392C; //0x0473
	bool N0000369E; //0x0474
	bool N00003310; //0x0475
	bool N000036A0; //0x0476
	bool N00003311; //0x0477
	bool N0000175C; //0x0478
	bool N00003313; //0x0479
	bool N000036A3; //0x047A
	bool N00003930; //0x047B
	bool N000036A4; //0x047C
	bool N00003314; //0x047D
	bool N000036A6; //0x047E
	bool N00003315; //0x047F
	bool N0000175D; //0x0480
	bool N00003317; //0x0481
	bool N000036A9; //0x0482
	bool N00003934; //0x0483
	bool N000036AA; //0x0484
	bool N00003318; //0x0485
	bool N000036AC; //0x0486
	bool N00003319; //0x0487
	bool N0000175E; //0x0488
	bool N0000331B; //0x0489
	bool N000036AF; //0x048A
	bool N00003938; //0x048B
	bool N000036B0; //0x048C
	bool N0000331C; //0x048D
	bool N000036B2; //0x048E
	bool N0000331D; //0x048F
	bool N0000175F; //0x0490
	bool N0000331F; //0x0491
	bool N000036B5; //0x0492
	bool N0000393C; //0x0493
	bool N000036B6; //0x0494
	bool N00003320; //0x0495
	bool N000036B8; //0x0496
	bool N00003321; //0x0497
	bool N00001760; //0x0498
	bool N00003323; //0x0499
	bool N000036BB; //0x049A
	bool N00003940; //0x049B
	bool N000036BC; //0x049C
	bool N00003324; //0x049D
	bool N000036BE; //0x049E
	bool N00003325; //0x049F
	bool N00001761; //0x04A0
	bool N00003327; //0x04A1
	bool N000036C1; //0x04A2
	bool N00003944; //0x04A3
	bool N000036C2; //0x04A4
	bool N00003328; //0x04A5
	bool N000036C4; //0x04A6
	bool N00003329; //0x04A7
	bool N00001762; //0x04A8
	bool N0000332B; //0x04A9
	bool N000036C7; //0x04AA
	bool N00003948; //0x04AB
	bool N000036C8; //0x04AC
	bool N0000332C; //0x04AD
	bool N000036CA; //0x04AE
	bool N0000332D; //0x04AF
	bool N00001763; //0x04B0
	bool N0000332F; //0x04B1
	bool N000036CD; //0x04B2
	bool N0000394C; //0x04B3
	bool N000036CE; //0x04B4
	bool N00003330; //0x04B5
	bool N000036D0; //0x04B6
	bool N00003331; //0x04B7
	bool N00001764; //0x04B8
	bool N00003333; //0x04B9
	bool N000036D3; //0x04BA
	bool N00003950; //0x04BB
	bool N000036D4; //0x04BC
	bool N00003334; //0x04BD
	bool N000036D6; //0x04BE
	bool N00003335; //0x04BF
	bool N00001765; //0x04C0
	bool N00003337; //0x04C1
	bool N000036D9; //0x04C2
	bool N00003954; //0x04C3
	bool N000036DA; //0x04C4
	bool N00003338; //0x04C5
	bool N000036DC; //0x04C6
	bool N00003339; //0x04C7
	bool N00001766; //0x04C8
	bool N0000333B; //0x04C9
	bool N000036DF; //0x04CA
	bool N00003958; //0x04CB
	bool N000036E0; //0x04CC
	bool N0000333C; //0x04CD
	bool N000036E2; //0x04CE
	bool N0000333D; //0x04CF
	bool N00001767; //0x04D0
	bool N0000333F; //0x04D1
	bool N000036E5; //0x04D2
	bool N0000395C; //0x04D3
	bool N000036E6; //0x04D4
	bool N00003340; //0x04D5
	bool N000036E8; //0x04D6
	bool N00003341; //0x04D7
	bool N00001768; //0x04D8
	bool N00003343; //0x04D9
	bool N000036EB; //0x04DA
	bool N00003960; //0x04DB
	bool N000036EC; //0x04DC
	bool N00003344; //0x04DD
	bool N000036EE; //0x04DE
	bool N00003345; //0x04DF
	bool N00001769; //0x04E0
	bool N00003347; //0x04E1
	bool N000036F1; //0x04E2
	bool N00003964; //0x04E3
	bool N000036F2; //0x04E4
	bool N00003348; //0x04E5
	bool N000036F4; //0x04E6
	bool N00003349; //0x04E7
}; //Size: 0x04E8
auto CHud::get_instance() -> const bool
{
	memory->read<hudd>(memory->base_address);
	return (this->base_address = memory->read<std::uintptr_t>(memory->base_address + offsets::CHud)) != 0;
}

auto CHud::penetration_crosshair(const bool enabled) -> void
{
	memory->write<bool>(this->base_address + offsets::chud::arcade_crosshair, enabled);
}

auto CHud::can_select_unit(const bool enabled) -> void
{
	memory->write<bool>(this->base_address + offsets::chud::can_select_unit, enabled);
}

auto CHud::aircraft_selection(const bool enabled) -> void
{
	memory->write<bool>(this->base_address + offsets::chud::aircraft_distance, enabled);
}

auto CHud::ground_to_air_prediction(const bool enabled) -> void
{
	memory->write<bool>(this->base_address + offsets::chud::ground_to_air_prediction, !enabled); // false to true???
}

auto CHud::vehicle_names(const bool enabled) -> void
{
